{
  "intro": [
    {
      "subtitle": "Qu’est-ce que l’informatique de périphérie ?"
    },
    {
      "text": "L’informatique de périphérie, ou Edge Computing, est un paradigme informatique visant à rendre plus efficace les systèmes utilisant l’infonuagique. Alors que la tendance chez les grandes entreprises est généralement de centraliser les infrastructures informatiques sur un serveur dans le nuage¹, l’informatique de périphérie consiste plutôt à traiter les données à proximité de leur source. Cela a plusieurs avantages tels qu’un temps de réponse plus rapide, une moins grande dépendance au réseau et une utilisation plus économique de la bande passante."
    },
    {
      "subtitle": "Pourquoi est-ce nécessaire ?"
    },
    {
      "text": "Malgré qu’Internet soit très rapide, car les données voyagent à la vitesse de la lumière, ce n’est pas instantané, et sur de longues distances, cela peut impacter la vitesse de traitement de l’information. Certains usages de l’informatique nécessitent un temps de réponse presque instantané et ne peuvent pas supporter qu’il y ait de la latence. Pour pallier cela, des entreprises vont installer des machines en périphérie. C’est-à-dire qu’au lieu d’utiliser un serveur central, il y a un serveur à proximité de chaque infrastructure. L’informatique de périphérie est utile dans différents cas, notamment pour les entreprises qui ont des services numériques éparpillés dans plusieurs endroits et qui veulent que leurs services soient extrêmement rapides peu importe l’emplacement de l’utilisateur. Au lieu que les données soient toujours envoyées sur un serveur central, qui est potentiellement éloigné géographiquement, les données sont traitées sur une machine à proximité, évitant de devoir traverser de longues distances et réduisant la latence dans le traitement de l’information."
    }
  ],
  "countries": [
    {
      "title": "Canada",
      "body": [
        {
          "text": "CENGN, une organisation basée à Ottawa, possède une serre intelligente en Ontario qui utilise l’Internet des objets pour s’automatiser, servant de laboratoire pour que les compagnies œuvrant dans le domaine des technologies de l’agriculture puissent prototyper². L’infrastructure récolte constamment des données comme l’humidité, la température et des images provenant d’objets connectés. Le CENGN utilise l’informatique de périphérie pour traiter ces données sur des serveurs mis en place directement sur le site de la serre. Les serveurs utilisent ces données pour prendre une décision et renvoie une réponse aux objets connectés en conséquence. Malgré que ce ne soit qu’un prototype, l’organisation croit que les futures serres intelligentes utiliseront l’informatique de périphérie plutôt que d’utiliser un fournisseur infonuagique certainement situé plus loin géographiquement. Au lieu que les données fassent des aller-retours sur de longues distances, cela fait en sorte que les données provenant des capteurs de la serre ont une très petite distance à parcourir avant d’être analysés, donc une plus petite latence et une utilisation moins gourmande du réseau."
        }
      ]
    },
    {
      "title": "États-Unis",
      "body": [
        {
          "subtitle": "Technologies Web"
        },
        {
          "text": "Cloudflare est une entreprise américaine qui offre des services de sécurité pour les sites web³. Les entreprises voulant un site web fiable et non-vulnérable, mais ne voulant pas s’occuper de toute la maintenance, utilisent Cloudflare. Ce service se place entre les utilisateurs et le site web et peut répartir les requêtes, s’assurant de ne pas surcharger le site en question. Si un utilisateur est au Québec et que le site web est hébergé à Londres, l’utilisateur va en premier devoir passer par le serveur de Cloudflare avant d’accéder au site web. Cela offre une protection au site, mais ajoute aussi une étape intermédiaire qui augmente la distance que doit parcourir les données et peut faire doubler le temps de chargement. Pour remédier à cela, Cloudflare a un réseau de serveurs périphériques à plusieurs endroits dans le monde, ce qui veut dire qu’il y a toujours un serveur à proximité de l’utilisateur. De cette manière, la latence est minimisée."
        },
        {
          "text": "L’informatique de périphérie est aussi utilisée par des solutions d’hébergement de sites web. Vercel est un hébergeur de sites web qui offre la possibilité de déployer son site sur plusieurs lieux géographiques en même temps. En effet, grâce à son “Edge Network”⁴, Vercel déploie les sites web de ses clients sur différents serveurs dans le monde. L’avantage est que si un utilisateur veut se connecter au site, il va se connecter au serveur le plus rapproché. Traditionnellement, un site web hébergé à un seul endroit ne pouvait pas offrir le même temps de chargement à tout le monde dépendamment de la position géographique des utilisateurs, mais avec l’informatique de périphérie, Vercel peut garantir un court temps de chargement peu importe l’emplacement."
        },
        {
          "subtitle": "Industriel"
        },
        {
          "text": "Chevron, une compagnie dans l’industrie du pétrole, utilise l’informatique de périphérie pour plusieurs tâches. En effet, dû à ses opérations dans plusieurs endroits dans le monde, l’Internet n’est pas toujours facile d’accès. Par exemple, la compagnie possède des installations au large de la mer, les rendant très éloignées. Il est donc très approprié que les installations éloignées aient leurs propres serveurs sur place. Effectivement, leurs plateformes pétrolières collectent beaucoup de données provenant de capteurs qui surveillent la qualité de la machinerie⁵. Certains capteurs surveillent du matériel critique afin notamment d’assurer que la pression dans les tuyaux n’est pas trop élevée. Si ces capteurs détectent quelque chose d’anormal, il faut qu’ils agissent rapidement. Avoir des serveurs sur place leur permet de réduire la latence au maximum. En plus, ils sauvent beaucoup de bande passante, donc aussi de l’argent. Comme la compagnie opère dans différents pays, cela facilite aussi la conformité avec les lois sur la résidence des données de chaque pays⁶. Les données peuvent être traitées sur place de manière conforme aux lois du pays dans lequel les données sont collectées, avant d’être envoyées aux serveurs du siège social de Chevron."
        }
      ]
    },
    {
      "title": "France",
      "body": [
        {
          "text": "Menta est une compagnie qui se spécialise dans les puces reprogrammables. C’est-à-dire des microprocesseurs avec une circuiterie modifiable même après la fabrication. La compagnie croit que l’informatique de périphérie nécessitera des machines avec microprocesseurs personnalisés⁷. En effet, les serveurs qui analysent les données à proximité de leur source, ont souvent une tâche très spécifique et traitent les données de manière différente en fonction de ce que veut la compagnie. Comme les microprocesseurs traditionnels tout usage ne sont pas nécessairement optimisés pour cette tâche, Menta offre la possibilité de programmer une puce pour qu’elle soit le plus adaptée pour la tâche qu’elle exécute et que le processus soit plus efficace."
        }
      ]
    },
    {
      "title": "Royaume-Uni",
      "body": [
        {
          "subtitle": "Infonuagique"
        },
        {
          "text": "Ori Industries est une compagnie qui se spécialise dans les services infonuagiques. La compagnie propose une solution pour déployer une application sur différent fournisseur infonuagique (Google, Amazon, Azure), en même temps⁸. Cela leur permet d’offrir un réseau périphérique encore plus vaste, car ils ne dépendent pas de la localisation des centres de données d’un fournisseur en particulier."
        },
        {
          "subtitle": "Internet des objets"
        },
        {
          "text": "Une autre compagnie britannique se spécialisant dans l’informatique de périphérie est Zededa. C'est une plateforme SaaS pour gérer un réseau de machines périphériques à grande échelle⁹. Par exemple, une compagnie qui possède plusieurs infrastructures et qui a un serveur dans chacune de celles-ci, peut facilement surveiller ses serveurs à partir de l’interface de Zededa. Le logiciel permet de facilement détecter s’il y a des problèmes avec une des infrastructures, de s’assurer que tous les points d’accès sont sécurisés, et même de pouvoir mettre à jour les logiciels exécutés sur les machines périphériques. Zededa évite ainsi de devoir aller physiquement maintenir les serveurs, qui peuvent parfois être localisés dans des endroits difficiles d’accès."
        }
      ]
    },
    {
      "title": "Singapour",
      "body": [
        {
          "text": "ST Engineering, une compagnie de Singapour offrant des services dans le domaine de la sécurité pour les agences et les gouvernements, notamment des modèles d’intelligence artificielle pour de la reconnaissance faciale, de la détection de comportements anormales, et plus encore¹⁰. Leur service inclut la possibilité d’intégrer l’informatique de périphérie et de faire tourner leur logiciel d’intelligence artificielle sur des systèmes embarquées (appareil électronique spécialisé pour effectuer une tâche)¹¹. Cela permet par exemple de récupérer le flux d’une caméra de surveillance et de l’envoyé sur un ordinateur, et c’est ce même ordinateur qui exécutera le modèle d’IA de reconnaissance faciale. Les données de la caméra n’ont donc même pas besoin de passer par Internet, elles sont directement traitées sur place. Ce système a l’avantage de fonctionner sans connexion à un réseau, et n’a aucune latence."
        }
      ]
    }
  ],
  "sources": [
    "https://explodingtopics.com/blog/corporate-cloud-data",
    "www.cengn.ca/services/commercialization-services/smart-agriculture-program/",
    "www.cloudflare.com/application-services/",
    "vercel.com/docs/concepts/edge-network/overview",
    "www.iothub.com.au/news/chevron-scales-up-industrial-iot-pilot-513758",
    "https://www.datacenterknowledge.com/microsoft/how-microsoft-extending-its-cloud-chevron-s-oil-fields",
    "www.lepoint.fr/services/menta-le-leader-europeen-de-la-reprogrammation-hardware-embarquee-28-03-2022-2469874_4345.php",
    "ori.co/multicloud-networking",
    "zededa.com/products/",
    "https://www.stengg.com/en/digital-tech/data-science-analytics-and-ai/video-analytics/",
    "https://www.stengg.com/en/digital-tech/data-science-analytics-and-ai/edge-analytics/"
  ],
  "title": "Edge computing",
  "subtitle": "À la merci de tous"
}