{
  "intro": [
    {
      "text": "Le principe de l’internet des objets (Internet of Things ou IoT) consiste en le fait de connecter des objets physiques à Internet. Il apparait souvent sous forme de capteurs qui collectent des données sur leur environnement. Un lave-vaisselle intelligent, un système d’alarme, des caméras de surveillance, sont tous des exemples d’appareils qui peuvent être connectés à internet. Ces illustrations peuvent inclure aussi les machines utilisées dans les procédés industriels où l’IoT est très utilisé, ce qui fait de cette technologie un incontournable de l’industrie 4.0². Les principaux avantages de relier des objets à un réseau sont l’accessibilité, et une réactivité en temps réel³(un serveur au Canada qui reçoit les données d’un objet en Asie peut agir en une fraction de seconde malgré la distance)."
    },
    {
      "text": "L’IoT repose sur des technologies de communications sans fil, qui permettent aux objets connectés de collecter des données sur leur environnement et de les transmettre à des serveurs via Internet pour une analyse ultérieure⁴. Les données collectées par les appareils connectés peuvent être sensibles, et il est important de mettre en place des mesures de sécurité pour protéger ces données. Cela est d’autant plus important dans le cas des appareils de domotique, où ces derniers ont accès à la vie privée des particuliers. Le fait de connecter un objet à internet ouvre une porte, et le rend automatiquement plus vulnérable aux attaques informatiques d’où l’importance d’un système de sécurité, corollaire à la mise en place de l’IoT en tant que technologie."
    },
    {
      "subtitle": "## État des lieux des domaines phares de l’utilisation de l’Internet des objets"
    },
    {
      "text": "Le Centre d'innovation Numérique (CIN) a mené une analyse approfondie sur la progression et l'adoption de la technologie de l’IoT dans plusieurs pays de l'OCDE et au-delà. Ce document synthétise les points remarquables et les découvertes notables de cette étude."
    }
  ],
  "countries": [
    {
      "title": "Le Canada",
      "body": [
        {
          "subtitle": "L’agriculture"
        },
        {
          "text": "Le Canada utilise l’IoT dans nombreuses de ses industries, notamment dans l’agriculture. En effet, l’agriculture dépend de plusieurs facteurs :  les conditions météorologiques, la qualité de la terre, l’irrigation et encore plusieurs autres variables qui peuvent être surveillées grâce à des capteurs connectés. Par exemple la Société canadienne Farmers Edge⁵ utilise des capteurs pour surveiller la température et l’humidité du sol, ainsi que des images satellites pour cartographier les cultures et les zones touchées par des insectes ravageurs. Les données capturées par la compagnie sont ensuite transmises aux utilisateurs qui peuvent mieux prévoir leurs récoltes."
        },
        {
          "subtitle": "La santé"
        },
        {
          "text": "L’IoT s’avère aussi très utile dans le domaine de la santé. Des dispositifs permettent aux médecins de surveiller leurs patients à distance. L’entreprise basée en Ontario Cloud DX⁶ utilise l’IoT et une plateforme en ligne pour que les médecins puissent suivre les signes vitaux des patients. Ils vendent des trousses qui contiennent des appareils qui captent des signes vitaux comme la pression, le battement du cœur, la température et plus encore. Lorsqu’un patient utilisera un de ces appareils, par exemple le thermomètre, sa température sera directement envoyée à son médecin. Cette collecte de données permet aux professionnels de facilement surveiller l’état des patients."
        },
        {
          "subtitle": "Les services publics"
        },
        {
          "text": "Les villes peuvent aussi se servir de ces technologies pour améliorer leur gestion notamment des déchets, du trafic, ou bien encore du niveau de pollution. Toronto utilise des capteurs qui mesurent les niveaux de polluants dans l’air⁷, permettant une meilleure gestion et surveillance de la qualité de l’air sans devoir déployer de la main d’œuvre de manière récurrente sur le terrain. Autre utilisation très commune de l’IoT par les villes est les radars de vitesse autonomes⁸. Ces derniers sont programmés pour prendre une photo de la plaque d’immatriculation d’une voiture si celle-ci dépasse la limite de vitesse. La machine va ensuite envoyer cette photo via Internet à l’institution qui s’en charge pour qu’elle puisse donner une contravention."
        }
      ]
    },
    {
      "title": "Les États-Unis, champion du domaine",
      "body": [
        {
          "subtitle": "Logistique et services de livraison"
        },
        {
          "text": "Les États-Unis possèdent environ huit milliards d’appareils IoT⁹ faisant d’eux un des pays avec le plus d’objets connectés dans le monde. Les grosses chaînes de production américaine utilisent de plus en plus l’IoT pour automatiser leurs processus.  Amazon est notamment une compagnie pionnière dans l’utilisation de l’IIoT (Industrial Internet of Things). Cet industrie 4.0 consiste à utiliser des objets connectés dans le but d’avoir un meilleur rendement. Amazon s’en sert dans son processus de livraison des commandes pour le rendre plus efficace. Le géant de la livraison a acheté Kiva Systems en 2012¹⁰, et Cloostermans plus récemment en 2019¹¹. Ces acquisitions lui ont permis d’intégrer leur base de données avec des robots connectés. Ainsi, les machines dans les entrepôts peuvent prévoir d’avance leurs tâches en fonction des commandes qui ont été faites."
        },
        {
          "subtitle": "Domotique"
        },
        {
          "text": "La compagnie Cisco a une plateforme appelée Cisco Spaces, qui est fait pour intégrer l’IoT dans les immeubles commerciaux. Dans un bâtiment équipé de Spaces, il est possible surveiller toute l’activité dans l’immeuble grâce à des capteurs et des caméras¹². Si les employés ont des badges, il est même possible de savoir où est tel employé à tel moment. Spaces saura aussi sauver de l’énergie et minimiser la consommation d’électricité en alimentant seulement les services nécessaires. Google aussi offre plusieurs services pour « automatiser » sa maison avec Google Nest¹³. En effet, la compagnie vend des haut-parleurs intelligents, des caméras de surveillance et même un thermostat connecté. Celui-ci permet aux propriétaires de changer la température depuis leur téléphone, et est beaucoup plus écoénergétique car il apprend les habitudes des propriétaires et s’assure de chauffer seulement lorsque nécessaire. Il utilise des capteurs pour vérifier si la maison est vide ou non et baisse la température la nuit comme la plupart des gens préfère dormir au frais."
        },
        {
          "subtitle": "Les voitures connectées"
        },
        {
          "text": "Le manufacturier de voiture Tesla¹⁴ munit ses véhicules de receveurs cellulaires et WiFi. Cela est très utile pour l’utilisateur car certaines fonctions comme la musique en streaming nécessitent du réseau. C’est d'autant plus utile pour la compagnie, car cela lui permet de récolter des données sur les voitures, dans le but d’améliorer son service. Cela permet aussi à la voiture de pouvoir faire des mises à jour de son logiciel aussi simplement qu’une mise à jour sur un téléphone. Ford aussi équipe certains de ses véhicules avec un modem 4G, permettant aux utilisateurs de voir en temps réel des informations sur leur véhicule et de verrouiller/déverrouiller les portes, voir même de démarrer le moteur à distance¹⁵."
        }
      ]
    },
    {
      "title": "La France",
      "body": [
        {
          "text": "En 2017, la France a décidé de faciliter l’intégration de l’IoT en introduisant un nouveau numéro d’appel à 14 chiffres, différent des numéros classiques à 10 chiffres, pour supporter la demande grandissante des objets connectés¹⁶. Ces numéros seront principalement attribués aux cartes SIM M2M (Machine to Machine), des puces spécialement conçues pour la communication sans fil entre plusieurs machines. La plupart des gros fournisseurs de connectivités comme Bouygues, Orange et SFR offrent déjà une gamme de puces M2M. L’entreprise française CityScoot, qui offre des mobylettes électriques libre-service, équipe leurs véhicules de cartes M2M pour pouvoir surveiller leurs flottes à distance et localiser chaque véhicule en temps réel¹⁷."
        }
      ]
    },
    {
      "title": "Royaume-Uni",
      "body": [
        {
          "text": "Du côté de l’Écosse, un gros projet est en cours de développement visant à créer une interface digitale pour la maintenance des réseaux routiers. La société DigiFlec travaille avec le centre d’innovation écossais CENSIS et la FLS (Forestry and Land Scotland), avec le financement de l’accélérateur gouvernemental CivTech dans le but de déployer des capteurs qui récupèrent des données sur les conditions routières¹⁸. Ces données seront transmises en direct et pourront permettre à la FLS de couvrir 10,000 kilomètres de réseau routier en tout temps. Cela leur donne une vision sur l’entièreté des routes à partir d’une interface centralisée, rendant la maintenance beaucoup plus efficace et leur sauvant beaucoup de temps."
        }
      ]
    },
    {
      "title": "La Finlande",
      "body": [
        {
          "text": "La Finlande héberge des compagnies importantes dans le domaine de l’internet des objets, notamment la compagnie de téléphone Nokia qui offre des services pour faciliter l’usage de l‘IoT. En effet, elle vend des logiciels en tant que services (SaaS) pour aider les vendeurs à gérer les cartes SIM dans leurs objets connectés ainsi qu’à collecter des données à partir de ceux-ci¹⁹. L&T Smartti Automation, elle, est une compagnie qui a travaillé sur des projets de bâtiments intelligents. La compagnie utilise des capteurs connectés et de l’intelligence artificielle qui analyse les données en temps réel pour sauver le plus d'énergie possible dans les bâtiments²⁰. Malgré les côtés positifs de l’IoT, en 2016, la Finlande a subi les conséquences d’une implantation non sécuritaire de cette technologie. En effet, des bâtiments se sont fait pirater par des cybercriminels qui ont réussi à contrôler le système de chauffage à distance²¹. Ce n’est pas un évènement qui a laissé les résidents indifférents considérant que la température peut être assez froide durant les hivers finlandais.  C’est le type d’incident qui est possible si l’IoT n’est pas intégré de manière sécuritaire et fiable."
        }
      ]
    },
    {
      "title": "L’Allemagne",
      "body": [
        {
          "text": "L’Allemagne est un des chefs de tête en termes d’IoT en Europe²². La compagnie allemande de livraison DHL équipe sa flotte de véhicule avec de dispositifs connectés à Internet, leur permettant de gérer leur flotte de véhicules à travers le monde²³. De plus, la compagnie utilise l’IoT pour traquer où sont rendu les colis et cela leur permet de donner une estimation précise au client de la date d’arrivée de celui-ci. Certain colis nécessite parfois d’être conservé dans des conditions particulière, donc DHL utilise des thermomètres connectés pour s’assurer que les paquets nécessitant une température plus basse que la normale (comme des vaccins), n’ont pas été exposé à des température plus haute qu’un certain seuil."
        }
      ]
    },
    {
      "title": "La Norvège",
      "body": [
        {
          "text": "Plusieurs compagnies avec des solutions d’objets connectés sont établies en Norvège. Une de ces compagnies est Defigo, un fournisseur norvégien de système d’intercom intelligent pour les immeubles résidentiels et commerciaux²⁴. Defigo permet aux résidents de déverrouiller leur appartement avec une application sur leur téléphone. Cette application offre aussi la possibilité de donner temporairement accès à l’appartement pour des visiteurs, des livreurs, ou des contracteurs. Il y a également un système d’intercom qui permet aux résidents de voir par caméras les visiteurs qui sonnent pour entrer dans l’immeuble et même de leur parler."
        }
      ]
    },
    {
      "title": "Singapour",
      "body": [
        {
          "text": "L’IMDA, une organisation du gouvernement de Singapour a en date d’aujourd’hui déjà publié cinq standards concernant l’IoT et a même établie un guide d’utilisation basé sur ces standards²⁵. Ces mesures sont des recommandations dans le but que les différents vendeurs d’objets connectés puissent s’aligner et ainsi qu’il soit plus facile le développer des projets IoT à grande échelle. Ces standards vont certainement servir Singapour dans son plan “Smart Mobility 2030”, qui vise à moderniser le système de transport avec des systèmes intelligents et l’IoT²⁶. Par exemple, son plan parle de véhicules autonomes qui seraient connectés à internet et que les habitants pourraient commander avec leur téléphone. De plus, grâce à des capteurs et un algorithme capable de détecter le trafic sur des images provenant de satellites, le prix des transports seraient actualiser en temps réel en fonction de la congestion routière."
        }
      ]
    }
  ],
  "sources": [
    "<a href=\"https://www.cms-connected.com/PromoNews/What-is-Industry-IoT-4-0\">What is Industry IoT (4.0)? | CMS Connected (cms-connected.com)</a>",
    "<a href=\"https://www.oracle.com/internet-of-things/what-is-iot/\">https://www.oracle.com/internet-of-things/what-is-iot/</a>",
    "wikipedia.org/wiki/Internet_of_things",
    "<a href=\"https://farmersedge.ca/farmcommand/\">FarmCommand: Manage Data to Boost Returns Across Every Acre (farmersedge.ca)</a>",
    "www.clouddx.com/#/connectedhealthkit",
    "<a href=\"https://www.cbc.ca/news/canada/toronto/u-of-t-showcases-next-generation-air-quality-monitoring-1.5292472\">How hi-tech sensors on buildings, cars and in the sky could help keep Toronto's air clean | CBC News</a>",
    "www.toronto.ca/services-payments/streets-parking-transportation/road-safety/vision-zero/safety-initiatives/automated-speed-enforcement/",
    "<a href=\"https://bytebeam.io/blog/the-most-important-iot-stats-for-2023/\">The most important IoT stats for 2023 (bytebeam.io)</a>",
    "<a href=\"https://www.logisticsmgmt.com/article/amazon.com_to_acquire_kiva_systems\">Amazon.com to acquire Kiva Systems - Logistics Management (logisticsmgmt.com)</a>",
    "<a href=\"https://www.cnbc.com/2022/09/09/amazon-acquires-warehouse-machinery-and-robotics-maker-cloostermans.html\">Amazon acquires warehouse machinery and robotics maker Cloostermans (cnbc.com)</a>",
    "spaces.cisco.com",
    "store.google.com/ca/product/nest_learning_thermostat_3rd_gen?sku=_nest_learning_thermostat_3rd_gen&hl=fr-CA",
    "www.tesla.com/autopilot",
    "<a href=\"https://www.ford.ca/technology/connected-technology/\">Ford Mobile WIFI And Connected Technology | Ford.ca</a>",
    "<a href=\"https://www.matooma.com/fr/s-informer/actualites-de-matooma/cartes-sim-m2m-les-numeros-dappel-passent-a-14-chiffres\">Les numéros d’appel passent à 14 chiffres (Cartes SIM M2M) (matooma.com)</a>",
    "www.cityscoot.eu/wp-content/uploads/2018/07/20151021-CP-2015.pdf",
    "<a href=\"https://www.verdict.co.uk/how-scotland-plans-to-use-the-internet-of-things-to-maintain-roads/\">How Scotland plans to use the Internet of Things to maintain roads (verdict.co.uk)</a>",
    "www.nokia.com/networks/internet-of-things/impact-iot-platform/",
    "<a href=\"https://www.connectedfinland.fi/featured/lassila-tikanoja-and-connected-inventions-collaborate-for-energy-saving-efforts-for-commercial-properties/\">L&T and Connected Inventions collaborate for energy-saving efforts (connectedfinland.fi)</a>",
    "<a href=\"https://www.ibtimes.co.uk/hackers-leave-finnish-residents-cold-after-ddos-attack-knocks-out-heating-systems-1590639\">Hackers freeze Finland residents with DDoS attack that briefly knocked out heating systems (ibtimes.co.uk)</a>",
    "<a href=\"https://www.statista.com/statistics/686531/internet-of-things-iot-market-share-in-europe-by-country/\">IoT market share by country in Europe 2014 and 2020 | Statista</a>",
    "<a href=\"https://www.dhl.com/global-en/delivered/digitalization/the-value-of-iot-in-supply-chains.html\">The value of IoT in supply chains | Delivered | Global (dhl.com)</a>",
    "https://www.getdefigo.com",
    "<a href=\"https://www.imda.gov.sg/regulations-and-licensing-listing/ict-standards-and-quality-of-service/IT-Standards-and-Frameworks/Internet-of-Things\">Internet of Things (IoT) | IMDA - Infocomm Media Development Authority</a>",
    "www.lta.gov.sg/content/ltagov/en/getting_around/driving_in_singapore/intelligent_transport_systems.html"
  ],
  "title": "Article sur l’IoT",
  "subtitle": "Qu’est-ce l’Internet des objets ?"
}